doc/pandas-part2.org
#+title: Pandas: Cleaning and operating on data
#+setupfile: setup.org
#+options: ^:{}

In [[./pandas-part1.org][part 1]] we covered reading and viewing data. We'll use the same data
set to demonstrate how to carry out calculations in Pandas. If you would
prefer an overview of some of the methods we'll use before seeing them
in action, jump to [[Overview of methods for performing calculations]] and
then come back.

* Reading in and cleaning the data

First, let's read in the data and set the rows to the well column
values.

#+begin_src python :session
  import pandas as pd
  qdat = pd.read_csv('../data/qpcr.csv',
                     na_values='Undetermined')
  qdat.set_index('Well', inplace=True)
#+end_src

#+RESULTS[523b65b0503b550bfe16a38950f088b7368b2dd9]:

This is similar to how we read in the data last time, except for the
=na_values= parameter. This tells Pandas to treat the string
"Undetermined" as an indicator of a missing value. If we didn't do this,
the "Ct" column would be read in as strings because "Undetermined" would
be treated as a string, and all the values of a column must be the same
type.

To view the rows that have null C_{t} values, we can use =pd.isnull=.

#+begin_src python :session
  qdat[pd.isnull(qdat.Ct)]
#+end_src

#+RESULTS[f6243e25de77b68ccd75fabce31a7d97f67d7668]:
#+begin_example
     Sample_Name Detector_Name Reporter  Ct  Threshold
Well
337          NTC       FENG3_1     SYBR NaN       0.39
338          NTC       FENG3_1     SYBR NaN       0.39
339          NTC       FENG3_1     SYBR NaN       0.39
340          NTC       FENG3_2     SYBR NaN       0.36
341          NTC       FENG3_2     SYBR NaN       0.36
342          NTC       FENG3_2     SYBR NaN       0.36
343          NTC       FENG3_3     SYBR NaN       0.26
344          NTC       FENG3_3     SYBR NaN       0.26
345          NTC       FENG3_3     SYBR NaN       0.26
109   RMB200_OFC       FENG3_4     SYBR NaN       0.37
346          NTC       FENG3_4     SYBR NaN       0.37
347          NTC       FENG3_4     SYBR NaN       0.37
349          NTC         RPL32     SYBR NaN       0.40
350          NTC         RPL32     SYBR NaN       0.40
#+end_example

All but one of the null values occur a "no template control" well.

We can remove the wells using =dropna=.

#+begin_src python :session
  qdat = qdat.dropna(how='any')  # drop if any of row's cell is null
  ## Could also use: qdat = qdat[pd.notnull(qdat.Ct)]
#+end_src

#+RESULTS[e34e63aeefee0a95c07e806620b52f2dc77ddea3]:

Now we have a data frame that looks like this:

#+begin_src python :session
  qdat.head()
#+end_src

#+RESULTS[3426137496dcf7cdfbfdd2d51cfbbb4e5e9349f8]:
:      Sample_Name Detector_Name Reporter     Ct  Threshold
: Well
: 172   RMB200_A1C       FENG3_1     SYBR  26.44       0.39
: 173   RMB200_A1C       FENG3_1     SYBR  27.38       0.39
: 174   RMB200_A1C       FENG3_1     SYBR  27.76       0.39
: 187   RMB200_AMY       FENG3_1     SYBR  27.83       0.39
: 188   RMB200_AMY       FENG3_1     SYBR  28.94       0.39

Next, we can remove some columns we won't use. One of these is the
"Threshold" column. Another one is "Reporter", which does not vary over
the rows

#+begin_src python :session
  qdat.Reporter.unique()
#+end_src

#+RESULTS[5286948968591342f812f7a36731699ac40d56b4]:
: array(['SYBR'], dtype=object)

To drop columns, the =drop= method can be used. Setting =axis= to 1
tells =drop= that "Reporter" and "Threshold" are column names (=axis=0=
would indicate that they are row names).

#+begin_src python :session
  qdat = qdat.drop(['Reporter', 'Threshold'], axis=1)
#+end_src

#+RESULTS[3b4a1834011b576285d840fd2b6cb0913339242f]:

#+begin_src python :session
  qdat.head()
#+end_src

#+RESULTS[3426137496dcf7cdfbfdd2d51cfbbb4e5e9349f8]:
:      Sample_Name Detector_Name     Ct
: Well
: 172   RMB200_A1C       FENG3_1  26.44
: 173   RMB200_A1C       FENG3_1  27.38
: 174   RMB200_A1C       FENG3_1  27.76
: 187   RMB200_AMY       FENG3_1  27.83
: 188   RMB200_AMY       FENG3_1  28.94

* Initial data exploration

Now that we have a clean data frame, let's get a better feel for how the
data looks.

#+begin_src python :session
  qdat.info()
#+end_src

#+RESULTS[066c260efc09d549fbfb6bc09b71edb9539a6b91]:
: <class 'pandas.core.frame.DataFrame'>
: Int64Index: 240 entries, 172 to 351
: Data columns (total 3 columns):
: Sample_Name      240 non-null object
: Detector_Name    240 non-null object
: Ct               240 non-null float64
: dtypes: float64(1), object(2)
: memory usage: 7.5+ KB

We can use =nunique= to get the number of unique values in a column and
=unique= to list the unique values.

#+begin_src python :session
  qdat.Sample_Name.unique()
#+end_src

#+RESULTS[6376dd1ad54bd1aa0115f4cf0804d7c67182c40f]:
: array(['RMB200_A1C', 'RMB200_AMY', 'RMB200_CBL', 'RMB200_DFC',
:        'RMB200_HIP', 'RMB200_IPC', 'RMB200_ITC', 'RMB200_M1C',
:        'RMB200_MFC', 'RMB200_OFC', 'RMB200_S1C', 'RMB200_STC',
:        'RMB200_STR', 'RMB200_THM', 'RMB200_V1C', 'RMB200_VFC', 'NTC'], dtype=object)

#+begin_src python :session
  qdat.Detector_Name.unique()
#+end_src

#+RESULTS[de58f9b94128ccde207eec5e1681743e08cf99fb]:
: array(['FENG3_1', 'FENG3_2', 'FENG3_3', 'FENG3_4', 'RPL32'], dtype=object)

It would be good to know how many replicates we have for each
sample/detector combination. We can do this by using the =groupby=
method. We pass =groupby= the column names that have the variables that
we want to use to group the data. The =size= method of the =groupby=
object is used to determine the number of wells in each group.

#+begin_src python :session
  samp_det_grp = qdat.groupby(['Sample_Name', 'Detector_Name'])
  samp_gene_counts = samp_det_grp.size()
#+end_src

#+RESULTS[b8eed0b77339adb639cc8e5f4a7374d021a12ab7]:

#+begin_src python :session
  samp_gene_counts.head(10)
#+end_src

#+RESULTS[89233c6e1bf5c1ff285c93380060e1a049f78044]:
#+begin_example
Sample_Name  Detector_Name
NTC          FENG3_4          1
             RPL32            1
RMB200_A1C   FENG3_1          3
             FENG3_2          3
             FENG3_3          3
             FENG3_4          3
             RPL32            3
RMB200_AMY   FENG3_1          3
             FENG3_2          3
             FENG3_3          3
dtype: int64
#+end_example

Most of the sample/gene combinations seem to be in triplicate. Let's
view all the combinations that aren't.

#+begin_src python :session
  samp_gene_counts[samp_gene_counts != 3]
#+end_src

#+RESULTS[b8657238ea577e55d3fdad25924716b8250c6c5d]:
: Sample_Name  Detector_Name
: NTC          FENG3_4          1
:              RPL32            1
: RMB200_OFC   FENG3_4          2
: RMB200_THM   FENG3_1          2
: dtype: int64

