doc/pandas-part2.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Pandas: Cleaning and operating on data</title>
<!-- 2015-04-02 Thu 23:43 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<link rel="stylesheet" href="../css/theme.css" type="text/css"/>
</head>
<body>
<div id="content">
<h1 class="title">Pandas: Cleaning and operating on data</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#unnumbered-1">Reading in and cleaning the data</a></li>
<li><a href="#unnumbered-2">Initial data exploration</a></li>
<li><a href="#unnumbered-3">Performing calculations on the data frame</a></li>
<li><a href="#unnumbered-4">Overview of methods for performing calculations</a></li>
<li><a href="#unnumbered-5">Task</a></li>
<li><a href="#unnumbered-6">Relevant parts of Pandas documentation</a></li>
</ul>
</div>
</div>
<p>
In <a href="./pandas-part1.html">part 1</a> we covered reading and viewing data. We'll use the same data
set to demonstrate how to carry out calculations in Pandas. If you would
prefer an overview of some of the methods we'll use before seeing them
in action, jump to <a href="#unnumbered-4">Overview of methods for performing calculations</a> and
then come back.
</p>

<div id="outline-container-unnumbered-1" class="outline-2">
<h2 id="unnumbered-1">Reading in and cleaning the data</h2>
<div class="outline-text-2" id="text-unnumbered-1">
<p>
First, let's read in the data and set the rows to the well column
values.
</p>

<div class="org-src-container">

<pre class="src src-python"><span class="org-keyword">import</span> pandas <span class="org-keyword">as</span> pd
<span class="org-variable-name">qdat</span> = pd.read_csv(<span class="org-string">'../data/qpcr.csv'</span>,
                   na_values=<span class="org-string">'Undetermined'</span>)
qdat.set_index(<span class="org-string">'Well'</span>, inplace=<span class="org-constant">True</span>)
</pre>
</div>

<p>
This is similar to how we read in the data last time, except for the
<code>na_values</code> parameter. This tells Pandas to treat the string
"Undetermined" as an indicator of a missing value. If we didn't do this,
the "Ct" column would be read in as strings because "Undetermined" would
be treated as a string, and all the values of a column must be the same
type.
</p>

<p>
To view the rows that have null C<sub>t</sub> values, we can use <code>pd.isnull</code>.
</p>

<div class="org-src-container">

<pre class="src src-python">qdat[pd.isnull(qdat.Ct)]
</pre>
</div>

<pre class="example">
     Sample_Name Detector_Name Reporter  Ct  Threshold
Well
337          NTC       FENG3_1     SYBR NaN       0.39
338          NTC       FENG3_1     SYBR NaN       0.39
339          NTC       FENG3_1     SYBR NaN       0.39
340          NTC       FENG3_2     SYBR NaN       0.36
341          NTC       FENG3_2     SYBR NaN       0.36
342          NTC       FENG3_2     SYBR NaN       0.36
343          NTC       FENG3_3     SYBR NaN       0.26
344          NTC       FENG3_3     SYBR NaN       0.26
345          NTC       FENG3_3     SYBR NaN       0.26
109   RMB200_OFC       FENG3_4     SYBR NaN       0.37
346          NTC       FENG3_4     SYBR NaN       0.37
347          NTC       FENG3_4     SYBR NaN       0.37
349          NTC         RPL32     SYBR NaN       0.40
350          NTC         RPL32     SYBR NaN       0.40
</pre>

<p>
All but one of the null values occur a "no template control" well.
</p>

<p>
We can remove the wells using <code>dropna</code>.
</p>

<div class="org-src-container">

<pre class="src src-python"><span class="org-variable-name">qdat</span> = qdat.dropna(how=<span class="org-string">'any'</span>)  <span class="org-comment-delimiter"># </span><span class="org-comment">drop if any of row's cell is null</span>
<span class="org-comment-delimiter">## </span><span class="org-comment">Could also use: qdat = qdat[pd.notnull(qdat.Ct)]</span>
</pre>
</div>

<p>
Now we have a data frame that looks like this:
</p>

<div class="org-src-container">

<pre class="src src-python">qdat.head()
</pre>
</div>

<pre class="example">
     Sample_Name Detector_Name Reporter     Ct  Threshold
Well
172   RMB200_A1C       FENG3_1     SYBR  26.44       0.39
173   RMB200_A1C       FENG3_1     SYBR  27.38       0.39
174   RMB200_A1C       FENG3_1     SYBR  27.76       0.39
187   RMB200_AMY       FENG3_1     SYBR  27.83       0.39
188   RMB200_AMY       FENG3_1     SYBR  28.94       0.39
</pre>

<p>
Next, we can remove some columns we won't use. One of these is the
"Threshold" column. Another one is "Reporter", which does not vary over
the rows
</p>

<div class="org-src-container">

<pre class="src src-python">qdat.Reporter.unique()
</pre>
</div>

<pre class="example">
array(['SYBR'], dtype=object)
</pre>

<p>
To drop columns, the <code>drop</code> method can be used. Setting <code>axis</code> to 1
tells <code>drop</code> that "Reporter" and "Threshold" are column names (<code>axis=0</code>
would indicate that they are row names).
</p>

<div class="org-src-container">

<pre class="src src-python"><span class="org-variable-name">qdat</span> = qdat.drop([<span class="org-string">'Reporter'</span>, <span class="org-string">'Threshold'</span>], axis=1)
</pre>
</div>

<div class="org-src-container">

<pre class="src src-python">qdat.head()
</pre>
</div>

<pre class="example">
     Sample_Name Detector_Name     Ct
Well
172   RMB200_A1C       FENG3_1  26.44
173   RMB200_A1C       FENG3_1  27.38
174   RMB200_A1C       FENG3_1  27.76
187   RMB200_AMY       FENG3_1  27.83
188   RMB200_AMY       FENG3_1  28.94
</pre>
</div>
</div>

<div id="outline-container-unnumbered-2" class="outline-2">
<h2 id="unnumbered-2">Initial data exploration</h2>
<div class="outline-text-2" id="text-unnumbered-2">
<p>
Now that we have a clean data frame, let's get a better feel for how the
data looks.
</p>

<div class="org-src-container">

<pre class="src src-python">qdat.info()
</pre>
</div>

<pre class="example">
&lt;class 'pandas.core.frame.DataFrame'&gt;
Int64Index: 240 entries, 172 to 351
Data columns (total 3 columns):
Sample_Name      240 non-null object
Detector_Name    240 non-null object
Ct               240 non-null float64
dtypes: float64(1), object(2)
memory usage: 7.5+ KB
</pre>

<p>
We can use <code>nunique</code> to get the number of unique values in a column and
<code>unique</code> to list the unique values.
</p>

<div class="org-src-container">

<pre class="src src-python">qdat.Sample_Name.unique()
</pre>
</div>

<pre class="example">
array(['RMB200_A1C', 'RMB200_AMY', 'RMB200_CBL', 'RMB200_DFC',
       'RMB200_HIP', 'RMB200_IPC', 'RMB200_ITC', 'RMB200_M1C',
       'RMB200_MFC', 'RMB200_OFC', 'RMB200_S1C', 'RMB200_STC',
       'RMB200_STR', 'RMB200_THM', 'RMB200_V1C', 'RMB200_VFC', 'NTC'], dtype=object)
</pre>

<div class="org-src-container">

<pre class="src src-python">qdat.Detector_Name.unique()
</pre>
</div>

<pre class="example">
array(['FENG3_1', 'FENG3_2', 'FENG3_3', 'FENG3_4', 'RPL32'], dtype=object)
</pre>

<p>
It would be good to know how many replicates we have for each
sample/detector combination. We can do this by using the <code>groupby</code>
method. We pass <code>groupby</code> the column names that have the variables that
we want to use to group the data. The <code>size</code> method of the <code>groupby</code>
object is used to determine the number of wells in each group.
</p>

<div class="org-src-container">

<pre class="src src-python"><span class="org-variable-name">samp_det_grp</span> = qdat.groupby([<span class="org-string">'Sample_Name'</span>, <span class="org-string">'Detector_Name'</span>])
<span class="org-variable-name">samp_gene_counts</span> = samp_det_grp.size()
</pre>
</div>

<div class="org-src-container">

<pre class="src src-python">samp_gene_counts.head(10)
</pre>
</div>

<pre class="example">
Sample_Name  Detector_Name
NTC          FENG3_4          1
             RPL32            1
RMB200_A1C   FENG3_1          3
             FENG3_2          3
             FENG3_3          3
             FENG3_4          3
             RPL32            3
RMB200_AMY   FENG3_1          3
             FENG3_2          3
             FENG3_3          3
dtype: int64
</pre>

<p>
Most of the sample/gene combinations seem to be in triplicate. Let's
view all the combinations that aren't.
</p>

<div class="org-src-container">

<pre class="src src-python">samp_gene_counts[samp_gene_counts != 3]
</pre>
</div>

<pre class="example">
Sample_Name  Detector_Name
NTC          FENG3_4          1
             RPL32            1
RMB200_OFC   FENG3_4          2
RMB200_THM   FENG3_1          2
dtype: int64
</pre>
</div>
</div>
