doc/pandas-part2.org
* Performing calculations on the data frame

Pandas makes it easy to group the data and perform calculations on each
group. In our case, we want to \Delta\Delta{}C_{t} for each sample and
gene of interest.

In the first step, we need to normalize by the control detector, RPL32.
We can create two data frames, one with RPL32 and one with the genes of
interest, which appear to be variants of FENG3.

#+begin_src python :session
  is_rpl = qdat.Detector_Name == 'RPL32'
  rpl = qdat[is_rpl]

  fengs = qdat[~is_rpl].copy()  # ~ flips each True/False value
#+end_src

#+RESULTS[6d5f604aec0620316cc4a5298e6f5131f0d30e71]:

Each sample has replicates for RPL32 expression, so we want to group by
the sample and take the mean C_{t} value.

#+begin_src python :session
  rpl_grps = rpl.groupby('Sample_Name')
  rpl_means = rpl_grps['Ct'].mean()
  ## or as one step: rpl_means = rpl.groupby('Sample_Name').Ct.mean()
#+end_src

#+RESULTS[06aaeb5e97da8e07ff12df966d7db89e457dde5d]:

#+begin_src python :session
  rpl_means
#+end_src

#+RESULTS[a367004ba7d1c76896910cccdf97ae30a54705c3]:
#+begin_example
Sample_Name
NTC           36.600000
RMB200_A1C    20.536667
RMB200_AMY    20.460000
RMB200_CBL    21.780000
RMB200_DFC    21.616667
RMB200_HIP    20.790000
RMB200_IPC    20.583333
RMB200_ITC    20.750000
RMB200_M1C    21.226667
RMB200_MFC    20.683333
RMB200_OFC    20.293333
RMB200_S1C    20.803333
RMB200_STC    20.623333
RMB200_STR    20.556667
RMB200_THM    20.886667
RMB200_V1C    20.290000
RMB200_VFC    20.916667
Name: Ct, dtype: float64
#+end_example

We want to associate each RPL32 mean with the samples in =fengs=. One
way to do this is to just add the values as a column. A function can be
applied (mapped) to each column value by using =map=, with the return
values assigned as a new column.

#+begin_src python :session
  def get_rpl_mean(sample_name):
      return rpl_means[sample_name]

  fengs['rpl_mean'] = fengs.Sample_Name.map(get_rpl_mean)
#+end_src

#+RESULTS[cb663ba26bce968a497f229bebc6944e318caee1]:

#+begin_note
  *Note:* Above I define a simple function to map to all the values of
  the sample name column, but [[http://docs.python.org/3.3/reference/expressions.html#lambda][lambda expressions]] are often used for
  this purpose.
#+end_note

To calculate \Delta{}C_{t}, we just need to substract the "rpl_mean"
column from the "Ct" column.

#+begin_src python :session
  fengs['d_Ct'] = fengs.Ct - fengs.rpl_mean
#+end_src

#+RESULTS[f57d2dcf5c7bbafbab77481b79f73de3d772610b]:

#+begin_src python :session
  fengs.head()
#+end_src

#+RESULTS[f0c9173879b9db8a6019f07442762958f3b7bf91]:
:      Sample_Name Detector_Name     Ct   rpl_mean      d_Ct
: Well
: 172   RMB200_A1C       FENG3_1  26.44  20.536667  5.903333
: 173   RMB200_A1C       FENG3_1  27.38  20.536667  6.843333
: 174   RMB200_A1C       FENG3_1  27.76  20.536667  7.223333
: 187   RMB200_AMY       FENG3_1  27.83  20.460000  7.370000
: 188   RMB200_AMY       FENG3_1  28.94  20.460000  8.480000

We can use a similar approach to normalize all the \Delta{}C_{t} values
by the mean expression of one sample type (we will use "RMB200_A1C"). We
limit samples to A1C samples and then take the mean for each gene.

#+begin_src python :session
  fengs_a1c = fengs[fengs.Sample_Name == 'RMB200_A1C']
  a1c_means = fengs_a1c.groupby('Detector_Name')['d_Ct'].mean()

  def get_a1c_mean(detector_name):
      return a1c_means[detector_name]

  fengs['a1c_mean'] = fengs['Detector_Name'].map(get_a1c_mean)
#+end_src

#+RESULTS[845c1bcd873bbbaea3f11ab7d478a98d81f3e0a4]:

To calculate \Delta\Delta{}C_{t}, we subtract this "a1c_mean" column
from the \Delta{}C_{t} values.

#+begin_src python :session
  fengs['dd_Ct'] = fengs.d_Ct - fengs.a1c_mean
#+end_src

#+RESULTS[5746a57c7b0487a10d6461801ccf1a24ad7478f5]:

#+begin_src python :session
  fengs.head()
#+end_src

#+RESULTS[f0c9173879b9db8a6019f07442762958f3b7bf91]:
:      Sample_Name Detector_Name     Ct   rpl_mean      d_Ct  a1c_mean     dd_Ct
: Well
: 172   RMB200_A1C       FENG3_1  26.44  20.536667  5.903333  6.656667 -0.753333
: 173   RMB200_A1C       FENG3_1  27.38  20.536667  6.843333  6.656667  0.186667
: 174   RMB200_A1C       FENG3_1  27.76  20.536667  7.223333  6.656667  0.566667
: 187   RMB200_AMY       FENG3_1  27.83  20.460000  7.370000  6.656667  0.713333
: 188   RMB200_AMY       FENG3_1  28.94  20.460000  8.480000  6.656667  1.823333

Finally, we can calculate 2^{-\Delta\Delta{}C_{t}}.

#+begin_src python :session
  fengs['two_dd_Ct'] = 2 ** (-1 * fengs['dd_Ct'])
#+end_src

#+RESULTS[111567c1cda4755ca1da2ab2d3fe97518667368a]:

#+begin_src python :session
  fengs.head()
#+end_src

#+RESULTS[f0c9173879b9db8a6019f07442762958f3b7bf91]:
#+begin_example
     Sample_Name Detector_Name     Ct   rpl_mean      d_Ct  a1c_mean  \
Well
172   RMB200_A1C       FENG3_1  26.44  20.536667  5.903333  6.656667
173   RMB200_A1C       FENG3_1  27.38  20.536667  6.843333  6.656667
174   RMB200_A1C       FENG3_1  27.76  20.536667  7.223333  6.656667
187   RMB200_AMY       FENG3_1  27.83  20.460000  7.370000  6.656667
188   RMB200_AMY       FENG3_1  28.94  20.460000  8.480000  6.656667

         dd_Ct  two_dd_Ct
Well
172  -0.753333   1.685683
173   0.186667   0.878633
174   0.566667   0.675175
187   0.713333   0.609909
188   1.823333   0.282567
#+end_example

* Overview of methods for performing calculations

Above we used a few important methods for performing calculations, but I
did not completely cover any of these methods, and I left out a few
methods entirely. Here is a high-level overview of a few different tools
you can use.

- groupby :: Group data by criteria and perform operations on groups.
             This can include calculations on the data that keep the
             same shape as the input data set (transformations), those
             that produce a result for each group (aggregation), and
             those that remove groups that don't fit a certain criteria
             (filtering).
- map :: Apply a function to each element of a series. The series is
         often a column of a data frame. This returns a series of the
         same shape. To apply a function to each element of a data
         frame, =applymap= can be used.
- apply :: Apply a function to each row or column of a data frame. We
           did not use this above, but this is important for
           calculations that require information for more than one
           element of a row or column. This can be combined with
           =groupby=.

Each of these provides a way to efficiently operate on the data. Any
time you need to iterate over a data frame or series, you should
consider one of these methods.

* Task

There is a set of tasks contained in code/[[../code/array.ipynb][array.ipynb]] that involve
analyzing data/[[../data/array.csv][array.csv]]. The best way to get these files is by [[./syncing-tutorial.org][syncing]]
with the git repo.

To start the notebook, go to that directory in a terminal shell and run
=ipython notebook=.

