doc/pandas-part2.html

<div id="outline-container-unnumbered-3" class="outline-2">
<h2 id="unnumbered-3">Performing calculations on the data frame</h2>
<div class="outline-text-2" id="text-unnumbered-3">
<p>
Pandas makes it easy to group the data and perform calculations on each
group. In our case, we want to &Delta;&Delta;C<sub>t</sub> for each sample and
gene of interest.
</p>

<p>
In the first step, we need to normalize by the control detector, RPL32.
We can create two data frames, one with RPL32 and one with the genes of
interest, which appear to be variants of FENG3.
</p>

<div class="org-src-container">

<pre class="src src-python"><span class="org-variable-name">is_rpl</span> = qdat.Detector_Name == <span class="org-string">'RPL32'</span>
<span class="org-variable-name">rpl</span> = qdat[is_rpl]

<span class="org-variable-name">fengs</span> = qdat[~is_rpl].copy()  <span class="org-comment-delimiter"># </span><span class="org-comment">~ flips each True/False value</span>
</pre>
</div>

<p>
Each sample has replicates for RPL32 expression, so we want to group by
the sample and take the mean C<sub>t</sub> value.
</p>

<div class="org-src-container">

<pre class="src src-python"><span class="org-variable-name">rpl_grps</span> = rpl.groupby(<span class="org-string">'Sample_Name'</span>)
<span class="org-variable-name">rpl_means</span> = rpl_grps[<span class="org-string">'Ct'</span>].mean()
<span class="org-comment-delimiter">## </span><span class="org-comment">or as one step: rpl_means = rpl.groupby('Sample_Name').Ct.mean()</span>
</pre>
</div>

<div class="org-src-container">

<pre class="src src-python">rpl_means
</pre>
</div>

<pre class="example">
Sample_Name
NTC           36.600000
RMB200_A1C    20.536667
RMB200_AMY    20.460000
RMB200_CBL    21.780000
RMB200_DFC    21.616667
RMB200_HIP    20.790000
RMB200_IPC    20.583333
RMB200_ITC    20.750000
RMB200_M1C    21.226667
RMB200_MFC    20.683333
RMB200_OFC    20.293333
RMB200_S1C    20.803333
RMB200_STC    20.623333
RMB200_STR    20.556667
RMB200_THM    20.886667
RMB200_V1C    20.290000
RMB200_VFC    20.916667
Name: Ct, dtype: float64
</pre>

<p>
We want to associate each RPL32 mean with the samples in <code>fengs</code>. One
way to do this is to just add the values as a column. A function can be
applied (mapped) to each column value by using <code>map</code>, with the return
values assigned as a new column.
</p>

<div class="org-src-container">

<pre class="src src-python"><span class="org-keyword">def</span> <span class="org-function-name">get_rpl_mean</span>(sample_name):
    <span class="org-keyword">return</span> rpl_means[sample_name]

<span class="org-variable-name">fengs</span>[<span class="org-string">'rpl_mean'</span>] = fengs.Sample_Name.<span class="org-builtin">map</span>(get_rpl_mean)
</pre>
</div>

<div class="note">
<p>
<b>Note:</b> Above I define a simple function to map to all the values of
the sample name column, but <a href="http://docs.python.org/3.3/reference/expressions.html#lambda">lambda expressions</a> are often used for
this purpose.
</p>

</div>

<p>
To calculate &Delta;C<sub>t</sub>, we just need to substract the "rpl_mean"
column from the "Ct" column.
</p>

<div class="org-src-container">

<pre class="src src-python"><span class="org-variable-name">fengs</span>[<span class="org-string">'d_Ct'</span>] = fengs.Ct - fengs.rpl_mean
</pre>
</div>

<div class="org-src-container">

<pre class="src src-python">fengs.head()
</pre>
</div>

<pre class="example">
     Sample_Name Detector_Name     Ct   rpl_mean      d_Ct
Well
172   RMB200_A1C       FENG3_1  26.44  20.536667  5.903333
173   RMB200_A1C       FENG3_1  27.38  20.536667  6.843333
174   RMB200_A1C       FENG3_1  27.76  20.536667  7.223333
187   RMB200_AMY       FENG3_1  27.83  20.460000  7.370000
188   RMB200_AMY       FENG3_1  28.94  20.460000  8.480000
</pre>

<p>
We can use a similar approach to normalize all the &Delta;C<sub>t</sub> values
by the mean expression of one sample type (we will use "RMB200_A1C"). We
limit samples to A1C samples and then take the mean for each gene.
</p>

<div class="org-src-container">

<pre class="src src-python"><span class="org-variable-name">fengs_a1c</span> = fengs[fengs.Sample_Name == <span class="org-string">'RMB200_A1C'</span>]
<span class="org-variable-name">a1c_means</span> = fengs_a1c.groupby(<span class="org-string">'Detector_Name'</span>)[<span class="org-string">'d_Ct'</span>].mean()

<span class="org-keyword">def</span> <span class="org-function-name">get_a1c_mean</span>(detector_name):
    <span class="org-keyword">return</span> a1c_means[detector_name]

<span class="org-variable-name">fengs</span>[<span class="org-string">'a1c_mean'</span>] = fengs[<span class="org-string">'Detector_Name'</span>].<span class="org-builtin">map</span>(get_a1c_mean)
</pre>
</div>

<p>
To calculate &Delta;&Delta;C<sub>t</sub>, we subtract this "a1c_mean" column
from the &Delta;C<sub>t</sub> values.
</p>

<div class="org-src-container">

<pre class="src src-python"><span class="org-variable-name">fengs</span>[<span class="org-string">'dd_Ct'</span>] = fengs.d_Ct - fengs.a1c_mean
</pre>
</div>

<div class="org-src-container">

<pre class="src src-python">fengs.head()
</pre>
</div>

<pre class="example">
     Sample_Name Detector_Name     Ct   rpl_mean      d_Ct  a1c_mean     dd_Ct
Well
172   RMB200_A1C       FENG3_1  26.44  20.536667  5.903333  6.656667 -0.753333
173   RMB200_A1C       FENG3_1  27.38  20.536667  6.843333  6.656667  0.186667
174   RMB200_A1C       FENG3_1  27.76  20.536667  7.223333  6.656667  0.566667
187   RMB200_AMY       FENG3_1  27.83  20.460000  7.370000  6.656667  0.713333
188   RMB200_AMY       FENG3_1  28.94  20.460000  8.480000  6.656667  1.823333
</pre>

<p>
Finally, we can calculate 2<sup>-&Delta;&Delta;C<sub>t</sub></sup>.
</p>

<div class="org-src-container">

<pre class="src src-python"><span class="org-variable-name">fengs</span>[<span class="org-string">'two_dd_Ct'</span>] = 2 ** (-1 * fengs[<span class="org-string">'dd_Ct'</span>])
</pre>
</div>

<div class="org-src-container">

<pre class="src src-python">fengs.head()
</pre>
</div>

<pre class="example">
     Sample_Name Detector_Name     Ct   rpl_mean      d_Ct  a1c_mean  \
Well
172   RMB200_A1C       FENG3_1  26.44  20.536667  5.903333  6.656667
173   RMB200_A1C       FENG3_1  27.38  20.536667  6.843333  6.656667
174   RMB200_A1C       FENG3_1  27.76  20.536667  7.223333  6.656667
187   RMB200_AMY       FENG3_1  27.83  20.460000  7.370000  6.656667
188   RMB200_AMY       FENG3_1  28.94  20.460000  8.480000  6.656667

         dd_Ct  two_dd_Ct
Well
172  -0.753333   1.685683
173   0.186667   0.878633
174   0.566667   0.675175
187   0.713333   0.609909
188   1.823333   0.282567
</pre>
</div>
</div>

<div id="outline-container-unnumbered-4" class="outline-2">
<h2 id="unnumbered-4">Overview of methods for performing calculations</h2>
<div class="outline-text-2" id="text-unnumbered-4">
<p>
Above we used a few important methods for performing calculations, but I
did not completely cover any of these methods, and I left out a few
methods entirely. Here is a high-level overview of a few different tools
you can use.
</p>

<dl class="org-dl">
<dt>groupby</dt><dd>Group data by criteria and perform operations on groups.
This can include calculations on the data that keep the
same shape as the input data set (transformations), those
that produce a result for each group (aggregation), and
those that remove groups that don't fit a certain criteria
(filtering).</dd>
<dt>map</dt><dd>Apply a function to each element of a series. The series is
often a column of a data frame. This returns a series of the
same shape. To apply a function to each element of a data
frame, <code>applymap</code> can be used.</dd>
<dt>apply</dt><dd>Apply a function to each row or column of a data frame. We
did not use this above, but this is important for
calculations that require information for more than one
element of a row or column. This can be combined with
<code>groupby</code>.</dd>
</dl>

<p>
Each of these provides a way to efficiently operate on the data. Any
time you need to iterate over a data frame or series, you should
consider one of these methods.
</p>
</div>
</div>

<div id="outline-container-unnumbered-5" class="outline-2">
<h2 id="unnumbered-5">Task</h2>
<div class="outline-text-2" id="text-unnumbered-5">
<p>
There is a set of tasks contained in code/<a href="../code/array.ipynb">array.ipynb</a> that involve
analyzing data/<a href="../data/array.csv">array.csv</a>. The best way to get these files is by <a href="./syncing-tutorial.html">syncing</a>
with the git repo.
</p>

<p>
To start the notebook, go to that directory in a terminal shell and run
<code>ipython notebook</code>.
</p>
</div>
</div>
